{
  "backend/main.mo": "Motoko backend defining user profiles, platform catalog entries, submission plans, content drafts, keyword metrics, and access‑controlled query/update methods with storage mixins.",
  "feature_evidence.json": "JSON report mapping features to related files, components, and test IDs for build traceability.",
  "frontend-file-summaries.txt": "Plain-text JSON listing short summaries of various frontend i18n, submission, and platform page components.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global layout rules.",
  "frontend/index.html": "Main HTML entry loading fonts, setting RTL Persian defaults, and mounting the React app.",
  "frontend/src/App.tsx": "Application root configuring TanStack Router routes, theme/i18n providers, and auth/admin‑guarded pages.",
  "frontend/src/components/analyzer/SeoAnalyzerPanel.tsx": "Component rendering SEO analysis results with scores, checks, and suggestions for a content draft.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with localized text and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter and save basic user info.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Wrapper enforcing admin‑only access, showing loading state or an access‑denied screen as needed.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps children with authentication checks, showing loading or access‑denied screens and redirecting unauthenticated users.",
  "frontend/src/components/common/AccessDeniedScreen.tsx": "Displays an access‑denied message with a button to return to the home page.",
  "frontend/src/components/common/ConfirmDialog.tsx": "A reusable confirmation dialog using alert‑dialog components with customizable title, description, and confirm handling.",
  "frontend/src/components/content/DraftEditor.tsx": "Provides a full editor UI for modifying content drafts, including sections, metadata, and saving via a mutation hook.",
  "frontend/src/components/content/ExportActions.tsx": "Generates markdown from a draft and offers copy‑to‑clipboard and file download actions.",
  "frontend/src/components/content/ImageUploadField.tsx": "Handles image selection, preview, and removal using ExternalBlob for storage compatibility.",
  "frontend/src/components/content/TopicInputCard.tsx": "Lets users create a new content draft by entering a topic and optional image, then initializes default sections.",
  "frontend/src/components/keywords/ManualKeywordEntry.tsx": "Allows manual entry and management of keywords with target density, displaying them in a table.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, language toggle, authentication‑aware links, and mobile menu support.",
  "frontend/src/components/platforms/PlatformFilters.tsx": "Provides category and country filter controls for platform listings with a clear‑filters option.",
  "frontend/src/components/submissions/StatusBadge.tsx": "Displays a status badge with a variant and label based on the listing status using translations.",
  "frontend/src/components/submissions/SubmissionPlanEditor.tsx": "Form component allowing users to edit and save submission plan fields including status, URL, and notes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, platform catalog actions, and submission plans using the backend actor.",
  "frontend/src/i18n/LanguageProvider.tsx": "Manages app language and direction, persists selection, and provides a translation function.",
  "frontend/src/i18n/messages.ts": "Contains Farsi translation strings for navigation, submissions, platforms, content, and other UI text.",
  "frontend/src/index.css": "Sets up Tailwind layers and theme variables with RTL/LTR typography, dark mode, and layout adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDraftsPage.tsx": "Admin page showing a placeholder message for drafts.",
  "frontend/src/pages/admin/AdminKeywordsPage.tsx": "Admin page showing a placeholder message for keywords.",
  "frontend/src/pages/admin/AdminLayout.tsx": "Admin layout with sidebar navigation and routed content outlet.",
  "frontend/src/pages/admin/AdminPerformancePage.tsx": "Admin performance page with a placeholder message.",
  "frontend/src/pages/admin/AdminPlatformsPage.tsx": "Displays searchable platform list with add button and table view.",
  "frontend/src/pages/admin/AdminSubmissionPlansPage.tsx": "Admin submission plans page showing a placeholder message.",
  "frontend/src/pages/content/ContentWorkspacePage.tsx": "Content workspace for creating drafts, editing, and running SEO analysis.",
  "frontend/src/pages/HomePage.tsx": "Displays a hero section and feature cards linking to major site areas.",
  "frontend/src/pages/keywords/KeywordToolsPage.tsx": "Keyword tools page offering manual keyword entry.",
  "frontend/src/pages/performance/PerformanceTrackingPage.tsx": "Performance tracking page with a placeholder message.",
  "frontend/src/pages/platforms/PlatformDetailPage.tsx": "Shows detailed platform info and allows logged-in users to add it to a submission plan.",
  "frontend/src/pages/platforms/PlatformsListPage.tsx": "Platform listing page with search, filters, and navigable platform cards.",
  "frontend/src/pages/submissions/SubmissionPlanDashboardPage.tsx": "Displays submission plan stats and a list of plans with status badges and an inline editor per platform.",
  "frontend/src/utils/locale.ts": "Provides Persian number/date formatting helpers plus line-break preservation and word counting.",
  "frontend/src/utils/seoAnalyzer.ts": "Analyzes SEO drafts by checking word count, meta description, keywords, structure, tags, and reading time to produce a score and suggestions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, animations, and plugin setup for the frontend.",
  "project_state.json": "Project metadata describing platform goals, requirements, features, and image assets for a Persian-first SEO and content system."
}